LESSONS = {
    "обж": "ОБЖ",
    "география": "География",
    "физкультура": "Физкультура",
    "литература": "Литература",
    "история церкви": "История Церкви",
    "английский": "Английский",
    "ип": "ИП",
    "химия": "Химия",
    "дря": "ДРЯ",
    "русский язык": "Русский язык",
    "цся/литургика": "ЦСЯ/Литургика",
    "биология": "Биология",
    "информатика": "Информатика",
    "обществознание": "Обществознание",
    "история": "История",
    "физика": "Физика",
    "опв": "ОПВ",
    "алгебра": "Алгебра",
    "геометрия": "Геометрия",
}

ENGLISH_LESSONS = {
    "obzh": "ОБЖ",
    "geography": "География",
    "fizra": "Физкультура",
    "literature": "Литература",
    "history_of_church": "История Церкви",
    "english": "Английский",
    "ip": "ИП",
    "chemistry": "Химия",
    "dra" : "ДРЯ",
    "russian": "Русский язык",
    "csya_lityrgika": "ЦСЯ/Литургика",
    "biology": "Биология",
    "informatics": "Информатика",
    "society": "Обществознание",
    "history": "История",
    "physics": "Физика",
    "opv": "ОПВ",
    "alg": "Алгебра",
    "geom": "Геометрия"
}

RUSSIAN_LESSONS = {v: k for k, v in ENGLISH_LESSONS.items()}

SHORTCUTS = {
    "общество": "Обществознание",
    "русский": "Русский язык",
    "литра": "Литература",
    "цся": "ЦСЯ/Литургика",
    "литургика": "ЦСЯ/Литургика",
    "физра": "Физкультура",
}

WEEKDAYS = [
    'понедельник',
    'вторник',
    'среда',
    'четверг',
    'пятница',
    'суббота'
]

OWN_ID = [2098644058, 7205739089]
WEEKDAYS_DB = {
    "monday": "пн",
    "tuesday": "вт",
    "wednesday": "ср",
    "thursday": "чт",
    "friday": "пт",
    "saturday": "сб",
    "sunday": "вс"
}

OWN_CLASS = {
    "10_a": 2098644058,
    "10_b": 5472687359,
    "10_v": 5191932879
}